# Homebrew Bundle — managed by chezmoi
# Applied automatically by chezmoi when this file changes
# To add packages: edit this file, then run `chezmoi apply`

# CLI Tools
brew "bash"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dockutil"
brew "dust"
brew "eza"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grep"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "less"
brew "mas"
brew "nmap"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "pre-commit"
brew "python@3.11"
brew "python@3.13"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "valkey"
brew "vhs"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"

# Build / Dev dependencies
brew "openssl@3"
brew "pkgconf"

# Database
brew "mysql@8.4"

# Security & Privacy
brew "age"
brew "awscli"
brew "ggshield"
brew "gitleaks"

# Linters / formatters used by this repo's CI and pre-commit
brew "shellcheck"
brew "shfmt"
brew "yamllint"
brew "markdownlint-cli2"

# Test framework for tests/ (chezmoi-fix menu rendering, drift-check summary)
brew "bats-core"

# Desktop Apps — Browsers
cask "brave-browser"
cask "tor-browser"

# Desktop Apps — Dev Tools
cask "claude"
cask "claude-code"
cask "iterm2"
cask "jetbrains-toolbox"
cask "orbstack"
cask "visual-studio-code"

# Desktop Apps — Productivity
cask "google-drive"
cask "microsoft-teams"
cask "microsoft-word"
cask "zoom"

# Desktop Apps — Utilities
cask "bluesnooze"

# Desktop Apps — Privacy & Security
cask "fing"
cask "gpg-suite"
cask "lulu"
cask "nordvpn"
cask "proton-mail"

# Desktop Apps — AI
cask "chatgpt"

{{ if eq .machine_type "personal" -}}
# Desktop Apps — Media & Social
cask "tidal"

# Desktop Apps — Crypto
cask "monero-wallet"
cask "sparrow"
{{ end -}}

# Mac App Store (requires signed-in Apple ID)
mas "Amphetamine", id: 937984704
