# Homebrew Bundle — managed by chezmoi
# Applied automatically by chezmoi when this file changes
# To add packages: edit this file, then run `chezmoi apply`

# Taps
tap "aws/tap"

# CLI Tools
brew "bash"
brew "chezmoi"
brew "gh"
brew "git"
brew "go"
brew "grep"
brew "n"
brew "nmap"
brew "pandoc"
brew "pipx"
brew "python@3.11"
brew "redis"
brew "ruby"
brew "thefuck"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"

# Build / Dev dependencies
brew "automake"
brew "binutils"
brew "libass"
brew "libffi"
brew "libmagic"
brew "libmemcached"
brew "libxml2"
brew "openssl@3"
brew "pcre"
brew "pkgconf"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Database
brew "mysql-client"
brew "mysql@8.0"
brew "uwsgi"

# Security & Privacy
brew "ggshield"

# Cloud
brew "aws/tap/lightsailctl"

# Desktop Apps — Browsers
cask "brave-browser"
cask "firefox"
cask "tor-browser"

# Desktop Apps — Dev Tools
cask "claude"
cask "claude-code"
cask "cursor"
cask "iterm2"
cask "jetbrains-toolbox"
cask "orbstack"
cask "pgadmin4"
cask "postgres-app"
cask "postico"
cask "visual-studio-code"
cask "windsurf"

# Desktop Apps — Productivity
cask "alfred"
cask "google-drive"
cask "notion"
cask "obsidian"
cask "slack"

# Desktop Apps — Utilities
cask "abyssoft-teleport"
cask "bluesnooze"
cask "font-iosevka"
cask "raspberry-pi-imager"

# Desktop Apps — Privacy & Security
cask "gpg-suite"
cask "lulu"
cask "nordvpn"
cask "proton-mail"

# Desktop Apps — AI
cask "chatgpt"
cask "chatgpt-atlas"

# Desktop Apps — Media & Social
cask "spotify"
cask "steam"
cask "tidal"
cask "whatsapp"

# Desktop Apps — Crypto
cask "monero-wallet"
cask "sparrow"

# Desktop Apps — Other
cask "algoapp"

# Mac App Store (install manually)
# - Amphetamine (keeps Mac awake)

# VS Code Extensions
vscode "ahmadalli.vscode-nginx-conf"
vscode "amazonwebservices.amazon-q-vscode"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "dejmedus.tailwind-sorter"
vscode "dnut.rewrap-revived"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "msjsdiag.vscode-react-native"
vscode "mutantdino.resourcemonitor"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "rokoroku.vscode-theme-darcula"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-cspell-bundled-dictionaries"
vscode "tamasfe.even-better-toml"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
